_org/2019-05-18-finished-the-practice-of-python.org
#+STARTUP: showall
#+STARTUP: hidestars
#+OPTIONS: H:2 num:nil tags:nil toc:nil timestamps:t
#+LAYOUT: post
#+AUTHOR: yefeiyu
#+DATE: 2019-05-18 Sat 18:36
#+TITLE: Finished the practice of Python
#+DESCRIPTION: the First time
#+TAGS: soft, python
#+CATEGORIES: soft

* 
4.10.1 逗号代码
假定有下面这样的列表：
spam = ['apples', 'bananas', 'tofu', 'cats']
编写一个函数，它以一个列表值作为参数，返回一个字符串。该字符串包含所
有表项，表项之间以逗号和空格分隔，并在最后一个表项之前插入and。例如，将
前面的spam 列表传递给函数，将返回'apples, bananas, tofu, and cats'。但你的函数应
该能够处理传递给它的任何列表。

* 
#+BEGIN_SRC python

text=''
spam=['apple','banana','cangroo','asdfa','tofu','cats']
c=len(spam)
d=range(len(spam))
for i in d:
    if i == c-1:
        text += 'and ' + spam[i] + "\'"
    elif i == 0:
        text += "\'" + spam[i] + ', '
    else:
        text += spam[i] + ', '
print(text)

#+END_SRC
the origin answer:
#+BEGIN_SRC python
text=''
spam=['apple','banana','tofu','cats']
for i in range(len(spam)):
    if i==0:
        text+='\''
        text+=(spam[i]+',')
    elif i!=(len(spam)-1):
        text+=(spam[i]+',')
    else:
        text+=('and '+spam[i])
        text+='\''
print(text)

#+END_SRC
The process I solve:
#+BEGIN_SRC python
text=''
spam=['apple','banana','cangroo','asdfa','tofu','cats']
c=len(spam)
d=range(len(spam))
for i in d:
#    if i == 0:
#        text+=(spam[i]+', ')
    if i !=(c-1):
        text+=(spam[i]+', ')
        
    else:
        text+=(' and ' +spam[i])
print(text)
#+END_SRC
#+BEGIN_SRC python
i == c-1:
        text+=(',and ' +spam[i])

    else:
        text+='\''
        text+=(spam[i]+',')
print(text)
#+END_SRC
It takes a lot of time, but it's fun.
